In [2]:
import pandas as pd
import os

# Load data

In [3]:
DATA_PATH = './RAIFHACK_datasets'

In [46]:
client_categories = pd.read_csv(os.path.join(DATA_PATH,'client_categories.csv'), sep=';')

In [47]:
client_categories.head()

   category                               description
0        10           VIP/ Management recommendations
1        11  VIP/ Management recommendations (family)
2        17         Private Banking customers walk-in
3        18         Private banking customers payroll
4        20                   High income individuals

In [48]:
client_categories.shape

(27, 2)

In [12]:
clients_last = pd.read_csv(os.path.join(DATA_PATH,'clients_last_2_fixed.csv'), sep=';')

In [13]:
clients_last.head()

    cnum_  categorycode gender  age     married_ residenttype
0  0CCCDO            81      M   32  not_married            R
1  0CCCFO            70      F   42  not_married            R
2  0CCCGC            50      F   33      married            R
3  0CCCGG            70      M   58  not_married            R
4  0CCCGO            60      M   38      married            R

In [44]:
clients_last.shape

(1355925, 6)

In [29]:
skidki = pd.read_csv(os.path.join(DATA_PATH,'skidki.csv'), sep=';', encoding='cp1251')

In [30]:
skidki.head()

,partner_name,offer_name,category,percents_,selltype,city_name,comment,enddate
0,Teana,Teanа,Парфюмерия и косметика,10.0,Online,NaN,Предложение действительно только в интернет-ма...,2021-10-01 03:00:00
1,Prime Travel,Prime Travel,Путешествия,5.0,Online,NaN,Кэшбэк – возврат средств.Сроки проведения акци...,2020-12-31 03:00:00
2,Special Travel Club,Special Travel Club,Путешествия,12.0,Online,NaN,NaN,2020-12-31 03:00:00
3,Hotels.com,Hotels.com,Путешествия,10.0,NaN,NaN,"Промокод действует только на отели, участвующи...",2020-12-31 03:00:00
4,Яндекс.Плюс,Яндекс.Плюс,Досуг и развлечения,NaN,Online,NaN,90 дней подписки Яндекс.Плюс. Активация по ссы...,2020-12-31 03:00:00

In [43]:
skidki.shape

(52, 8)

In [32]:
MCC = pd.read_excel(os.path.join(DATA_PATH,'MCC_last.xlsx'))

In [33]:
MCC.head()

    mcc                  category
0   742                       Pet
1   763                     Other
2   780  Maintenance and building
3  1520  Maintenance and building
4  1711  Maintenance and building

In [42]:
MCC.shape

(925, 2)

In [35]:
store_last = pd.read_csv(os.path.join(DATA_PATH,'store_last_2.csv'), sep=';', encoding='cp1251')

In [36]:
store_last.head()

  store_name              merchant_name
0   Банкомат  VVVVVVVVVVVVSG/W7J4K 07ZL
1       Киви     VVVVVVVVVVVVR4U4 CXD1O
2   Банкомат  VVVVVVVVVVV/078 WXWLH7J K
3   Банкомат  VVVVVVVVVVV/08 7JJ4T7H AK
4   Банкомат            VVVVVVVVVVV1SV6

In [41]:
store_last.shape

(503285, 2)

In [37]:
transactions_last = pd.read_csv(os.path.join(DATA_PATH,'transactions_last_2.csv'), sep=';', encoding='cp1251')

In [38]:
transactions_last.head()

,purchdate,amount,mcc,mrchcity,mrchname,cnum
0,2019-11-02 00:00:00,9000000.0,5691,MOSCOW,IA7D1H Z1D1T7,MJNLMQ
1,2019-11-02 00:00:00,9000000.0,5691,MOSCOW,IA7D1H Z1D1T7,MJNLMQ
2,2019-10-25 00:00:00,7716900.0,5691,MOSCOW,HXL4K TL4EEXD,ELETCO
3,2019-11-29 00:00:00,5100000.0,6513,SANKT-PETERBU,7X 1E7HXD H1DKW1IKCL,EL0KSF
4,2019-12-03 00:00:00,5023956.6,5944,MOSKVA,73 7HJXK7 (W7X),MPKIJJ

In [40]:
transactions_last.shape

(104161408, 6)